import time

# импортируем webdriver. это и есть набор команд для управления браузером
from selenium import webdriver

# инициализируем драйвер браузера. После этой команды вы должны увидеть новое открытое окно браузера
driver = webdriver.Chrome()

try:
    # команда time.sleep устанавливает паузу в 5 секунд, чтобы мы успели увидеть, что происходит в браузере
    time.sleep(5)

    # Метод get сообщает браузеру, что нужно открыть сайт по указанной ссылке
    driver.get("https://sbis.ru")
    time.sleep(5)
finally:
    # закрываем браузер после всех манипуляций
    driver.quit()