# Методы драйвера

# get()
# Перейти на заданный url

# current_url
# Получить текущий адрес сайта

# title
# Получить заголовок вкладки

# find_element()/find_elements()
# Найти элемент/список элементов

# windows_handles
# Получить список вкладок

# switch_to.window()
# Переключиться на вкладку

# maximize_window()
# Развернуть браузер на весь экран



# Методы элемента

# get_attribute()
# Получить значение атрибута по названию

# click()
# Клик по элементу

# send_keys()
# Ввод с клавиатуры

# сlear()
# Очистить введенный текст

# text
# Получить текст элемента

# is_displayed()
# Проверить отображение элемента

# location_once_scrolled_into_view
# Проскролить к элементу